OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_16.2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform  50;

boundaryField
{
    inlet
    {
        type                mapped;
        interpolationScheme cell;
        setAverage          false;
        average             0;
        value               uniform 50;
    }
    outlet
    {
        type            zeroGradient;
    }
    slip
    {
        type            slip;
    }
    rotaingWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    inletWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
