OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_16.2/Allrun.post
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s yPlus \
    simpleFoam -latestTime -postProcess -func yPlus



